### Import Libraries

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
from sklearn.model_selection import train_test_split

### Import Dataset

In [5]:
data = pd.read_csv("C:/Users/HP/Desktop/Data.csv") #reading the dataset

In [6]:
data

   Number  Country   Age Purchase
0       1   France  23.0        y
1       2  Germany  56.0        y
2       3   France   NaN        y
3       4   France  45.0        n
4       5       UK   NaN      NaN
5       6  Germany  40.0        y
6       7      NaN   NaN        y
7       8      NaN  32.0        n
8       9       UK  42.0      NaN
9      10      NaN  35.0        y

In [7]:
data.shape

(10, 4)

### Check missing values

In [26]:
print(data.isna())

   Number  Country    Age  Purchase
0   False    False  False     False
1   False    False  False     False
2   False    False   True     False
3   False    False  False     False
4   False    False   True      True
5   False    False  False     False
6   False     True   True     False
7   False     True  False     False
8   False    False  False      True
9   False     True  False     False

### Fill missing values with appropriate values

#### Way 1 (for categoricaql values)

In [36]:
data['Country'] = data['Country'].fillna('France')
data['Purchase'] = data['Purchase'].fillna('n')

In [37]:
data

   Number  Country   Age Purchase
0       1   France  23.0        y
1       2  Germany  56.0        y
2       3   France   NaN        y
3       4   France  45.0        n
4       5       UK   NaN        n
5       6  Germany  40.0        y
6       7   France   NaN        y
7       8   France  32.0        n
8       9       UK  42.0        n
9      10   France  35.0        y

#### Way 2

In [39]:
data['Country'] = data['Country'].map({'France':1,'Germany':2,'UK':3})
data['Purchase'] = data['Purchase'].map({'y':1,'n':0,'UK':3})

In [43]:
data

   Number  Country   Age  Purchase
0       1        1  23.0         1
1       2        2  56.0         1
2       3        1   NaN         1
3       4        1  45.0         0
4       5        3   NaN         0
5       6        2  40.0         1
6       7        1   NaN         1
7       8        1  32.0         0
8       9        3  42.0         0
9      10        1  35.0         1

### Else Leave it for LabelEncoder!!!

In [11]:
X = data.iloc[:,:-1].values  #selects all rows and all columns except last
y = data.iloc[:,3].values #slelects all rows and last column

#### For integer values

In [13]:
imputer = SimpleImputer(strategy = 'mean',missing_values=np.nan) #strategy = 'mean' or 'most_frequent' or 'constant'
imputer = imputer.fit(X[:,2:3])
X[:,2:3] = imputer.transform(X[:,2:3])
X

array([[1, 'France', 23.0],
       [2, 'Germany', 56.0],
       [3, 'France', 39.0],
       [4, 'France', 45.0],
       [5, 'UK', 39.0],
       [6, 'Germany', 40.0],
       [7, nan, 39.0],
       [8, nan, 32.0],
       [9, 'UK', 42.0],
       [10, nan, 35.0]], dtype=object)

### LabelEncoder

In [15]:
le = LabelEncoder()
X[:,1] = le.fit_transform(X[:,1])
y = le.fit_transform(y)
print(X,y)

[[1 0 23.0]
 [2 1 56.0]
 [3 0 39.0]
 [4 0 45.0]
 [5 2 39.0]
 [6 1 40.0]
 [7 3 39.0]
 [8 3 32.0]
 [9 2 42.0]
 [10 3 35.0]] [1 1 1 0 2 1 1 0 2 1]

### OneHotEncoder

In [17]:
one = OneHotEncoder()
X = one.fit_transform(X[:,1:3]).toarray()
X

array([[1., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 1., 0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0., 0., 1., 0., 0., 0., 0., 0.]])

In [24]:
y = y.reshape(-1,1)
one = OneHotEncoder()
y = one.fit_transform(y).toarray()
y

array([[0., 1., 0.],
       [0., 1., 0.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.]])